tests-results/results-Artillery/result_fork.txt
Phase started: unnamed (index: 0, duration: 1s) 23:32:38(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 23:32:39(-0300)

--------------------------------------
Metrics for period to: 23:32:40(-0300) (width: 1.299s)
--------------------------------------

http.codes.200: ................................................................ 60
http.request_rate: ............................................................. 62/sec
http.requests: ................................................................. 80
http.response_time:
  min: ......................................................................... 42
  max: ......................................................................... 443
  median: ...................................................................... 210.6
  p95: ......................................................................... 376.2
  p99: ......................................................................... 415.8
http.responses: ................................................................ 60
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20


--------------------------------------
Metrics for period to: 23:32:50(-0300) (width: 9.974s)
--------------------------------------

http.codes.200: ................................................................ 520
http.request_rate: ............................................................. 52/sec
http.requests: ................................................................. 520
http.response_time:
  min: ......................................................................... 371
  max: ......................................................................... 417
  median: ...................................................................... 383.8
  p95: ......................................................................... 399.5
  p99: ......................................................................... 407.5
http.responses: ................................................................ 520


--------------------------------------
Metrics for period to: 23:33:00(-0300) (width: 8.008s)
--------------------------------------

http.codes.200: ................................................................ 420
http.request_rate: ............................................................. 51/sec
http.requests: ................................................................. 400
http.response_time:
  min: ......................................................................... 132
  max: ......................................................................... 397
  median: ...................................................................... 376.2
  p95: ......................................................................... 391.6
  p99: ......................................................................... 391.6
http.responses: ................................................................ 420
vusers.completed: .............................................................. 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 17195.8
  max: ......................................................................... 18578.6
  median: ...................................................................... 18220
  p95: ......................................................................... 18588.1
  p99: ......................................................................... 18588.1


All VUs finished. Total time: 21 seconds

--------------------------------
Summary report @ 23:33:00(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 55/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 42
  max: ......................................................................... 443
  median: ...................................................................... 376.2
  p95: ......................................................................... 399.5
  p99: ......................................................................... 399.5
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 17195.8
  max: ......................................................................... 18578.6
  median: ...................................................................... 18220
  p95: ......................................................................... 18588.1
  p99: ......................................................................... 18588.1