tests-results/results-Artillery/result_fork_console.txt
Phase started: unnamed (index: 0, duration: 1s) 23:27:55(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 23:27:56(-0300)

--------------------------------------
Metrics for period to: 23:28:00(-0300) (width: 3.969s)
--------------------------------------

http.codes.200: ................................................................ 187
http.request_rate: ............................................................. 52/sec
http.requests: ................................................................. 207
http.response_time:
  min: ......................................................................... 48
  max: ......................................................................... 515
  median: ...................................................................... 399.5
  p95: ......................................................................... 432.7
  p99: ......................................................................... 468.8
http.responses: ................................................................ 187
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20


--------------------------------------
Metrics for period to: 23:28:10(-0300) (width: 9.982s)
--------------------------------------

http.codes.200: ................................................................ 497
http.request_rate: ............................................................. 50/sec
http.requests: ................................................................. 497
http.response_time:
  min: ......................................................................... 388
  max: ......................................................................... 432
  median: ...................................................................... 399.5
  p95: ......................................................................... 424.2
  p99: ......................................................................... 432.7
http.responses: ................................................................ 497


--------------------------------------
Metrics for period to: 23:28:20(-0300) (width: 6.36s)
--------------------------------------

http.codes.200: ................................................................ 316
http.request_rate: ............................................................. 47/sec
http.requests: ................................................................. 296
http.response_time:
  min: ......................................................................... 119
  max: ......................................................................... 425
  median: ...................................................................... 391.6
  p95: ......................................................................... 415.8
  p99: ......................................................................... 424.2
http.responses: ................................................................ 316
vusers.completed: .............................................................. 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 18314.2
  max: ......................................................................... 19601.8
  median: ...................................................................... 19346.7
  p95: ......................................................................... 19737.6
  p99: ......................................................................... 19737.6


All VUs finished. Total time: 21 seconds

--------------------------------
Summary report @ 23:28:17(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 50/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 48
  max: ......................................................................... 515
  median: ...................................................................... 399.5
  p95: ......................................................................... 424.2
  p99: ......................................................................... 432.7
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 18314.2
  max: ......................................................................... 19601.8
  median: ...................................................................... 19346.7
  p95: ......................................................................... 19737.6
  p99: ......................................................................... 19737.6